
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастройкиСтрокойВнутр	= Параметры.НастройкиСтрокойВнутр;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Команда_Сохранить(Команда)
		
	Если ПроверитьВозможностьСохранения() Тогда
		ОповеститьОВыборе(НастройкиСтрокойВнутр);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПроверитьВозможностьСохранения()
	
	Попытка
		Настройки	= ?(ПустаяСтрока(НастройкиСтрокойВнутр), Неопределено, 
			ЗначениеИзСтрокиВнутр(НастройкиСтрокойВнутр));
		Возврат Истина;
	Исключение
		Сообщить("Не удалось обернуть строку внутр в значение!");
		Возврат Ложь;
	КонецПопытки;

КонецФункции

#КонецОбласти
