
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтруктураСЗначениямиРеквизитовФормы	= СтруктураСЗначениямиРеквизитовФормы();
	
	ЗаполнитьЗначенияСвойств(СтруктураСЗначениямиРеквизитовФормы, Параметры);
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, СтруктураСЗначениямиРеквизитовФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    
    #Если ВебКлиент Тогда
        НедоступныеНастройки    = Новый Массив;
        НедоступныеНастройки.Добавить("РаботаСПараметрамиФорм");
        Для Каждого ТекущаяНастройка Из НедоступныеНастройки Цикл
        	ЭлементФормы    = Элементы["НастройкиОбработки_" + ТекущаяНастройка];
            ЭлементФормы.Доступность                    = Ложь;
            ЭлементФормы.ШрифтЗаголовка                 = Новый Шрифт(ЭлементФормы.ШрифтЗаголовка,,,,,,Истина);
            ЭлементФормы.РасширеннаяПодсказка.Заголовок = "Функционал недоступен в веб-клиенте";
        КонецЦикла;
    #КонецЕсли
    
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Команда_Сохранить(Команда)
	
	ОповеститьОВыборе(СтруктураСЗначениямиРеквизитовФормы());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СтруктураСЗначениямиРеквизитовФормы()

	СтруктураСЗначениямиРеквизитовФормы	= Новый Структура;
	
	Для Каждого РеквизитФормы Из ПолучитьРеквизиты() Цикл
		СтруктураСЗначениямиРеквизитовФормы.Вставить(РеквизитФормы.Имя, ЭтотОбъект[РеквизитФормы.Имя]);
	КонецЦикла;
	
	Возврат СтруктураСЗначениямиРеквизитовФормы;

КонецФункции

#КонецОбласти
