
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьЭлементыФормы(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ОбновитьЭлементыФормы(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

&НаКлиенте
Процедура ФиксированныеНастройкиОтборВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	//Если Поле = Элементы.ФиксированныеНастройкиОтборПравоеЗначение Тогда
	//	ПоказатьПравоеЗначение("ФиксированныеНастройки", ВыбраннаяСтрока);
	//КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиОтборВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	//Если Поле = Элементы.НастройкиОтборПравоеЗначение Тогда
	//	ПоказатьПравоеЗначение("Настройки", ВыбраннаяСтрока);
	//КонецЕсли; 

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПрименитьНастройки(Команда)
	
	//ВладелецФормы.Список.КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(КомпоновщикНастроек.ПользовательскиеНастройки);
	Закрыть(Новый Структура("ЗначениеРеквизита", КомпоновщикНастроек));
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьЭлементыФормы(ЭтаФорма)
	
	//ЭтоПользовательскиеНастройки	= (ЭтаФорма.Элементы.Страницы.ТекущаяСтраница = ЭтаФорма.Элементы.ПользовательскиеНастройки);
	//ЕстьФиксированныеОтборы			= (ЭтаФорма.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Количество() > 0);
	//ЕстьОбычныеОтборы				= (ЭтаФорма.КомпоновщикНастроек.Настройки.Отбор.Элементы.Количество() > 0);
	//
	//ОбщегоНазначенияУККлиентСервер.УстановитьСвойствоЭлемента(ЭтаФорма, "ФиксированныеНастройки", "Видимость"	, ЕстьФиксированныеОтборы);
	//ОбщегоНазначенияУККлиентСервер.УстановитьСвойствоЭлемента(ЭтаФорма, "ОбычныеНастройки"		, "Видимость"	, ЕстьОбычныеОтборы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПравоеЗначение(КоллекцияНастроек, ВыбраннаяСтрока)
	
	ПоказатьЗначение(, КомпоновщикНастроек[КоллекцияНастроек].Отбор.ПолучитьОбъектПоИдентификатору(ВыбраннаяСтрока).ПравоеЗначение);
	
КонецПроцедуры


#КонецОбласти


